balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1933.PIC
        <edc:SFRDef edc:access="nnn-nnn-" edc:cname="LCDREF" edc:desc="LCD Reference Voltage Control Register" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-000-" edc:name="LCDREF" edc:nzwidth="8" edc:por="000-000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="VLCD1PE" edc:desc="VLCD1 pin enable bit" edc:mask="0x1" edc:name="VLCD1PE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VLCD2PE" edc:desc="VLCD2 pin enable bit" edc:mask="0x1" edc:name="VLCD2PE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VLCD3PE" edc:desc="VLCD3 pin enable bit" edc:mask="0x1" edc:name="VLCD3PE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LCDIRI" edc:desc="LCD Internal Reference Ladder Idle Enable bit" edc:mask="0x1" edc:name="LCDIRI" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LCDIRS" edc:desc="LCD Internal Reference Source bit" edc:mask="0x1" edc:name="LCDIRS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LCDIRE" edc:desc="LCD Internal Reference Enable bit" edc:mask="0x1" edc:name="LCDIRE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="LCDCST" edc:desc="LCD Contrast Control Register" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="LCDCST" edc:nzwidth="8" edc:por="-----000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LCDCST0" edc:desc="LCD Contrast Control bits" edc:mask="0x1" edc:name="LCDCST0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LCDCST1" edc:desc="LCD Contrast Control bits" edc:mask="0x1" edc:name="LCDCST1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LCDCST2" edc:desc="LCD Contrast Control bits" edc:mask="0x1" edc:name="LCDCST2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LCDCST" edc:desc="LCD Contrast Control bits" edc:mask="0x7" edc:name="LCDCST" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="LCDRL" edc:desc="LCD Reference Voltage Control Register" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="LCDRL" edc:nzwidth="8" edc:por="0000-000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LRLAT0" edc:desc="LCD Reference Ladder A Time interval control bits" edc:mask="0x1" edc:name="LRLAT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LRLAT1" edc:desc="LCD Reference Ladder A Time interval control bits" edc:mask="0x1" edc:name="LRLAT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LRLAT2" edc:desc="LCD Reference Ladder A Time interval control bits" edc:mask="0x1" edc:name="LRLAT2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LRLBP0" edc:desc="LCD Reference Ladder B Time Power Control bits" edc:mask="0x1" edc:name="LRLBP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LRLBP1" edc:desc="LCD Reference Ladder B Time Power Control bits" edc:mask="0x1" edc:name="LRLBP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LRLAP0" edc:desc="LCD Reference Ladder A Time Power Control bits" edc:mask="0x1" edc:name="LRLAP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LRLAP1" edc:desc="LCD Reference Ladder A Time Power Control bits" edc:mask="0x1" edc:name="LRLAP1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LRLAT" edc:desc="LCD Reference Ladder A Time interval control bits" edc:mask="0x7" edc:name="LRLAT" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LRLBP" edc:desc="LCD Reference Ladder B Time Power Control bits" edc:mask="0x3" edc:name="LRLBP" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="LRLAP" edc:desc="LCD Reference Ladder A Time Power Control bits" edc:mask="0x3" edc:name="LRLAP" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDSE0" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SE0" edc:desc="" edc:mask="0x1" edc:name="SE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE1" edc:desc="" edc:mask="0x1" edc:name="SE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE2" edc:desc="" edc:mask="0x1" edc:name="SE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE3" edc:desc="" edc:mask="0x1" edc:name="SE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE4" edc:desc="" edc:mask="0x1" edc:name="SE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE5" edc:desc="" edc:mask="0x1" edc:name="SE5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE6" edc:desc="" edc:mask="0x1" edc:name="SE6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE7" edc:desc="" edc:mask="0x1" edc:name="SE7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDSE1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDSE1" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SE8" edc:desc="" edc:mask="0x1" edc:name="SE8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE9" edc:desc="" edc:mask="0x1" edc:name="SE9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE10" edc:desc="" edc:mask="0x1" edc:name="SE10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE11" edc:desc="" edc:mask="0x1" edc:name="SE11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE12" edc:desc="" edc:mask="0x1" edc:name="SE12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE13" edc:desc="" edc:mask="0x1" edc:name="SE13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE14" edc:desc="" edc:mask="0x1" edc:name="SE14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SE15" edc:desc="" edc:mask="0x1" edc:name="SE15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="6"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA0" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG0COM0" edc:desc="" edc:mask="0x1" edc:name="SEG0COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG1COM0" edc:desc="" edc:mask="0x1" edc:name="SEG1COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2COM0" edc:desc="" edc:mask="0x1" edc:name="SEG2COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG3COM0" edc:desc="" edc:mask="0x1" edc:name="SEG3COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG4COM0" edc:desc="" edc:mask="0x1" edc:name="SEG4COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG5COM0" edc:desc="" edc:mask="0x1" edc:name="SEG5COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG6COM0" edc:desc="" edc:mask="0x1" edc:name="SEG6COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG7COM0" edc:desc="" edc:mask="0x1" edc:name="SEG7COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA1" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG8COM0" edc:desc="" edc:mask="0x1" edc:name="SEG8COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM0" edc:desc="" edc:mask="0x1" edc:name="SEG9COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM0" edc:desc="" edc:mask="0x1" edc:name="SEG10COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM0" edc:desc="" edc:mask="0x1" edc:name="SEG11COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM0" edc:desc="" edc:mask="0x1" edc:name="SEG12COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM0" edc:desc="" edc:mask="0x1" edc:name="SEG13COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM0" edc:desc="" edc:mask="0x1" edc:name="SEG14COM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM0" edc:desc="" edc:mask="0x1" edc:name="SEG15COM0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA3" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG0COM1" edc:desc="" edc:mask="0x1" edc:name="SEG0COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG1COM1" edc:desc="" edc:mask="0x1" edc:name="SEG1COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2COM1" edc:desc="" edc:mask="0x1" edc:name="SEG2COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG3COM1" edc:desc="" edc:mask="0x1" edc:name="SEG3COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG4COM1" edc:desc="" edc:mask="0x1" edc:name="SEG4COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG5COM1" edc:desc="" edc:mask="0x1" edc:name="SEG5COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG6COM1" edc:desc="" edc:mask="0x1" edc:name="SEG6COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG7COM1" edc:desc="" edc:mask="0x1" edc:name="SEG7COM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA4" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG8COM1" edc:desc="" edc:mask="0x1" edc:name="SEG8COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM1" edc:desc="" edc:mask="0x1" edc:name="SEG9COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM1" edc:desc="" edc:mask="0x1" edc:name="SEG10COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM1" edc:desc="" edc:mask="0x1" edc:name="SEG11COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM1" edc:desc="" edc:mask="0x1" edc:name="SEG12COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM1" edc:desc="" edc:mask="0x1" edc:name="SEG13COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM1" edc:desc="" edc:mask="0x1" edc:name="SEG14COM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM1" edc:desc="" edc:mask="0x1" edc:name="SEG15COM1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA6" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG0COM2" edc:desc="" edc:mask="0x1" edc:name="SEG0COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG1COM2" edc:desc="" edc:mask="0x1" edc:name="SEG1COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2COM2" edc:desc="" edc:mask="0x1" edc:name="SEG2COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG3COM2" edc:desc="" edc:mask="0x1" edc:name="SEG3COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG4COM2" edc:desc="" edc:mask="0x1" edc:name="SEG4COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG5COM2" edc:desc="" edc:mask="0x1" edc:name="SEG5COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG6COM2" edc:desc="" edc:mask="0x1" edc:name="SEG6COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG7COM2" edc:desc="" edc:mask="0x1" edc:name="SEG7COM2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA7" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG8COM2" edc:desc="" edc:mask="0x1" edc:name="SEG8COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG9COM2" edc:desc="" edc:mask="0x1" edc:name="SEG9COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG10COM2" edc:desc="" edc:mask="0x1" edc:name="SEG10COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG11COM2" edc:desc="" edc:mask="0x1" edc:name="SEG11COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG12COM2" edc:desc="" edc:mask="0x1" edc:name="SEG12COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG13COM2" edc:desc="" edc:mask="0x1" edc:name="SEG13COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG14COM2" edc:desc="" edc:mask="0x1" edc:name="SEG14COM2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG15COM2" edc:desc="" edc:mask="0x1" edc:name="SEG15COM2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LCDDATA9" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LCDDATA9" edc:nzwidth="0x8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEG0COM3" edc:desc="" edc:mask="0x1" edc:name="SEG0COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG1COM3" edc:desc="" edc:mask="0x1" edc:name="SEG1COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2COM3" edc:desc="" edc:mask="0x1" edc:name="SEG2COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG3COM3" edc:desc="" edc:mask="0x1" edc:name="SEG3COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG4COM3" edc:desc="" edc:mask="0x1" edc:name="SEG4COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG5COM3" edc:desc="" edc:mask="0x1" edc:name="SEG5COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG6COM3" edc:desc="" edc:mask="0x1" edc:name="SEG6COM3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG7COM3" edc:desc="" edc:mask="0x1" edc:name="SEG7COM3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
